tests/Orange_HRM.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.4.1">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">3</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <com.googlecode.jmeter.plugins.webdriver.config.ChromeDriverConfig guiclass="com.googlecode.jmeter.plugins.webdriver.config.gui.ChromeDriverConfigGui" testclass="com.googlecode.jmeter.plugins.webdriver.config.ChromeDriverConfig" testname="jp@gc - Chrome Driver Config" enabled="true">
          <boolProp name="WebDriverConfig.acceptinsecurecerts">false</boolProp>
          <boolProp name="WebDriverConfig.reset_per_iteration">false</boolProp>
          <stringProp name="WebDriverConfig.driver_path">C:\JMeter\WebDrivers\chromedriver.exe</stringProp>
          <boolProp name="WebDriverConfig.dev_mode">false</boolProp>
          <boolProp name="WebDriverConfig.headless">false</boolProp>
          <boolProp name="WebDriverConfig.maximize_browser">true</boolProp>
          <stringProp name="ChromeDriverConfig.additional_args">--headless --disable-gpu --no-sandbox --disable-dev-shm-usage</stringProp>
          <stringProp name="WebDriverConfig.proxy_type">SYSTEM</stringProp>
          <intProp name="WebDriverConfig.http_port">8080</intProp>
          <boolProp name="WebDriverConfig.use_http_for_all_protocols">true</boolProp>
          <intProp name="WebDriverConfig.https_port">8080</intProp>
          <boolProp name="WebDriverConfig.use_ftp_proxy">true</boolProp>
          <intProp name="WebDriverConfig.ftp_port">8080</intProp>
          <boolProp name="WebDriverConfig.use_socks_proxy">true</boolProp>
          <intProp name="WebDriverConfig.socks_port">8080</intProp>
          <stringProp name="WebDriverConfig.no_proxy">localhost</stringProp>
        </com.googlecode.jmeter.plugins.webdriver.config.ChromeDriverConfig>
        <hashTree/>
        <com.googlecode.jmeter.plugins.webdriver.sampler.WebDriverSampler guiclass="com.googlecode.jmeter.plugins.webdriver.sampler.gui.WebDriverSamplerGui" testclass="com.googlecode.jmeter.plugins.webdriver.sampler.WebDriverSampler" testname="Launch_Page" enabled="true">
          <stringProp name="WebDriverSampler.script">WDS.browser.get(&quot;https://opensource-demo.orangehrmlive.com/web/index.php/auth/login&quot;);
WDS.log.info(&quot;✅ Opened Login Page&quot;);

WDS.sampleResult.setResponseData(&quot;✅ Opened Login Page&quot;, &quot;UTF-8&quot;);
WDS.sampleResult.setSuccessful(true);
</stringProp>
          <stringProp name="WebDriverSampler.language">groovy</stringProp>
        </com.googlecode.jmeter.plugins.webdriver.sampler.WebDriverSampler>
        <hashTree/>
        <com.googlecode.jmeter.plugins.webdriver.sampler.WebDriverSampler guiclass="com.googlecode.jmeter.plugins.webdriver.sampler.gui.WebDriverSamplerGui" testclass="com.googlecode.jmeter.plugins.webdriver.sampler.WebDriverSampler" testname="Login_Page" enabled="true">
          <stringProp name="WebDriverSampler.script">// 💡 Required Java imports for explicit waits
import org.openqa.selenium.By;
import org.openqa.selenium.support.ui.WebDriverWait;
import org.openqa.selenium.support.ui.ExpectedConditions;
import java.time.Duration;

// Start test
WDS.sampleResult.sampleStart();

// Create wait instance
def wait = new WebDriverWait(WDS.browser, Duration.ofSeconds(15));

// Wait for username field
wait.until(ExpectedConditions.visibilityOfElementLocated(By.xpath(&quot;//input[@placeholder=&apos;Username&apos;]&quot;)));

// Fill login fields
WDS.browser.findElement(By.xpath(&quot;//input[@placeholder=&apos;Username&apos;]&quot;)).sendKeys(&quot;Admin&quot;);
WDS.browser.findElement(By.xpath(&quot;//input[@placeholder=&apos;Password&apos;]&quot;)).sendKeys(&quot;admin123&quot;);
WDS.browser.findElement(By.xpath(&quot;//button[@type=&apos;submit&apos;]&quot;)).click();

// Confirm login by waiting for profile icon
wait.until(ExpectedConditions.visibilityOfElementLocated(By.xpath(&quot;//p[@class=&apos;oxd-userdropdown-name&apos;]&quot;)));
// 💡 Wait for this menu item to be visible
wait.until(ExpectedConditions.visibilityOfElementLocated(
    By.xpath(&quot;//a[@class=&apos;oxd-main-menu-item active&apos;]//span[1]&quot;)
));
// Done
WDS.sampleResult.sampleEnd();
WDS.sampleResult.setSuccessful(true);
</stringProp>
          <stringProp name="WebDriverSampler.language">groovy</stringProp>
        </com.googlecode.jmeter.plugins.webdriver.sampler.WebDriverSampler>
        <hashTree/>
        <com.googlecode.jmeter.plugins.webdriver.sampler.WebDriverSampler guiclass="com.googlecode.jmeter.plugins.webdriver.sampler.gui.WebDriverSamplerGui" testclass="com.googlecode.jmeter.plugins.webdriver.sampler.WebDriverSampler" testname="PIM_Page" enabled="true">
          <stringProp name="WebDriverSampler.script">WDS.log.info(&quot;🔐 Filling login form&quot;);

var By = org.openqa.selenium.By;
var Duration = java.time.Duration;
var wait = new org.openqa.selenium.support.ui.WebDriverWait(WDS.browser, Duration.ofSeconds(10));
var ExpectedConditions = org.openqa.selenium.support.ui.ExpectedConditions;

// 🔄 Post-login: wait for dashboard/menu to load and click the sidebar item
wait.until(ExpectedConditions.elementToBeClickable(By.xpath(&quot;//span[normalize-space()=&apos;PIM&apos;]&quot;))).click();

WDS.log.info(&quot;✅ Login and post-login navigation successful&quot;);

WDS.sampleResult.setResponseData(&quot;✅ Login and dashboard menu clicked&quot;, &quot;UTF-8&quot;);
WDS.sampleResult.setSuccessful(true);
java.lang.Thread.sleep(5000);</stringProp>
          <stringProp name="WebDriverSampler.language">groovy</stringProp>
        </com.googlecode.jmeter.plugins.webdriver.sampler.WebDriverSampler>
        <hashTree/>
        <com.googlecode.jmeter.plugins.webdriver.sampler.WebDriverSampler guiclass="com.googlecode.jmeter.plugins.webdriver.sampler.gui.WebDriverSamplerGui" testclass="com.googlecode.jmeter.plugins.webdriver.sampler.WebDriverSampler" testname="Logout_Page" enabled="true">
          <stringProp name="WebDriverSampler.script">WDS.log.info(&quot;🚪 Logging out...&quot;);

var By = org.openqa.selenium.By;
var Duration = java.time.Duration;
var wait = new org.openqa.selenium.support.ui.WebDriverWait(WDS.browser, Duration.ofSeconds(10));
var ExpectedConditions = org.openqa.selenium.support.ui.ExpectedConditions;

// Click profile dropdown
wait.until(ExpectedConditions.elementToBeClickable(By.xpath(&quot;//p[@class=&apos;oxd-userdropdown-name&apos;]&quot;))).click();

// Click Logout
wait.until(ExpectedConditions.elementToBeClickable(By.xpath(&quot;//a[normalize-space()=&apos;Logout&apos;]&quot;))).click();

WDS.log.info(&quot;✅ Logout successful&quot;);

// Wait for 10 seconds
java.lang.Thread.sleep(2000);

WDS.sampleResult.setResponseData(&quot;✅ Logout done&quot;, &quot;UTF-8&quot;);
WDS.sampleResult.setSuccessful(true);
</stringProp>
          <stringProp name="WebDriverSampler.language">groovy</stringProp>
        </com.googlecode.jmeter.plugins.webdriver.sampler.WebDriverSampler>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">C:\JMeter\apache-jmeter-5.4.1\apache-jmeter-5.4.1\bin\reports\aggregate.csv</stringProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Aggregate Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">reports/aggregate.csv</stringProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>